In [1]:
import pandas as pd 
import numpy as np 
import tqdm as tqdm 
import matplotlib as plt 
import missingno
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [ ]:
# Opening the DataSet

In [4]:
df = pd.read_csv ('/Users/diegorodrigues/Documents/Iron_Hack/Part_Time_Jul_2020/000_Projects/Final/BBDD/afrus.csv')

In [5]:
df.head()

,id,id-2,first_name,last_name,treatment,gender,type,identification_type,identification,email,...,language_code,born_date,created_at,updated_at,deleted_at,country_id,department,ocupation,rest_address2,country_phone
0,1,1,Info,Afrus,2.0,M,NaN,NaN,NaN,NaN,...,es,1990-05-12,2019-06-08 22:22:54+00,2020-03-13 16:53:56.42+00,NaN,242.0,NaN,NaN,NaN,NaN
1,2,2,Diego,Rodríguez,2.0,M,NaN,NaN,NaN,NaN,...,en,1990-05-12,2019-06-08 22:22:54+00,2020-03-27 22:01:57.985+00,NaN,237.0,NaN,NaN,NaN,NaN
2,3,3,Diego,Rodríguez,2.0,M,NaN,NaN,NaN,NaN,...,en,1990-05-12,2019-06-09 02:22:54+00,2020-02-17 14:57:09.94+00,NaN,32.0,NaN,NaN,NaN,NaN
3,4,4,Eddie,Kennedy,1.0,m,NaN,NaN,23671511,rotzumvaf@gmail.com,...,en,1994-07-09,2019-06-09 07:22:55+00,2019-06-09 07:22:55+00,NaN,6.0,NaN,NaN,NaN,NaN
4,5,5,Bruce,Mattioli,2.0,f,NaN,NaN,4333950,rova@gmail.com,...,en,1995-07-28,2019-06-09 07:22:55+00,2019-06-09 07:22:55+00,NaN,245.0,NaN,NaN,NaN,NaN

In [6]:
df.tail()

,id,id-2,first_name,last_name,treatment,gender,type,identification_type,identification,email,...,language_code,born_date,created_at,updated_at,deleted_at,country_id,department,ocupation,rest_address2,country_phone
285897,286506,286506,Tatiana,Tamara,1.0,NaN,1.0,4.0,32693346,t_tamara@hotmail.com,...,ES,NaN,2020-11-28 20:54:26.602+00,2020-11-28 20:56:10.931+00,NaN,49.0,NaN,NaN,NaN,49.0
285898,286507,286507,Claudia,Carrillo Benitez,NaN,NaN,NaN,NaN,422893695378407,clayacabe411@gmail.com,...,NaN,NaN,2020-11-28 20:58:35.751+00,2020-11-28 20:58:35.751+00,NaN,NaN,NaN,NaN,NaN,NaN
285899,286508,286508,Edgardo Alexander,Guzmán Villalobos,1.0,NaN,1.0,NaN,NaN,e.alexandergv93@gmail.com,...,ES,NaN,2020-11-28 21:01:47.933+00,2020-11-28 21:01:47.933+00,NaN,67.0,NaN,NaN,NaN,NaN
285900,286509,286509,Jacqueline,natalie,NaN,NaN,1.0,NaN,NaN,janaespinozanoa@gmail.com,...,ES,NaN,2020-11-28 21:03:54.76+00,2020-11-28 21:03:54.76+00,NaN,176.0,NaN,NaN,NaN,NaN
285901,286510,286510,Myrna,Ubilla Hernando,2.0,NaN,1.0,NaN,NaN,myrubi@gmail.com,...,ES,NaN,2020-11-28 21:05:38.471+00,2020-11-28 21:05:38.471+00,NaN,45.0,NaN,NaN,NaN,NaN

In [7]:
df.columns

Index(['id', 'id-2', 'first_name', 'last_name', 'treatment', 'gender', 'type',
       'identification_type', 'identification', 'email', 'phone', 'state',
       'city', 'street', 'street_number', 'rest_address', 'zip_code',
       'time_zone', 'language_code', 'born_date', 'created_at', 'updated_at',
       'deleted_at', 'country_id', 'department', 'ocupation', 'rest_address2',
       'country_phone'],
      dtype='object')

In [11]:
df.id.value_counts().sum()

285902